wagiminator/Development-Boards/CH32X035F7P6_DevBoard/software/oled_sinewave/src/system.h
// ===================================================================================
// Basic System Functions for CH32X035/X034/X033                              * v1.2 *
// ===================================================================================
//
// This file must be included!!! The system configuration and the system clock are 
// set up automatically on system start.
//
// System clock functions available:
// ---------------------------------
// CLK_init()               init system clock according to F_CPU
// CLK_reset()              reset system clock to default state
//
// HSI_enable()             enable internal 48 MHz high-speed clock (HSI)
// HSI_disable()            disable HSI
// HSI_ready()              check if HSI is stable
//
// MCO_init()               init clock output to pin PB9
// MCO_setSYS()             output SYS_CLK on pin PB9
// MCO_setHSI()             output internal oscillator on pin PB9
// MCO_stop()               stop clock output
//
// Delay (DLY) functions available:
// --------------------------------
// DLY_ticks(n)             delay n system clock cycles
// DLY_us(n)                delay n microseconds
// DLY_ms(n)                delay n milliseconds
//
// Reset (RST) and Bootloader (BOOT) functions available:
// ------------------------------------------------------
// BOOT_now()               conduct software reset and jump to bootloader
// RST_now()                conduct software reset
// RST_clearFlags()         clear all reset flags
// RST_wasLowPower()        check if last reset was caused by low power
// RST_wasWWDG()            check if last reset was caused by window watchdog
// RST_wasIWDG()            check if last reset was caused by independent watchdog
// RST_wasSoftware()        check if last reset was caused by software
// RST_wasPower()           check if last reset was caused by power up
// RST_wasPin()             check if last reset was caused by RST pin low
// RST_wasOPA()             check if last reset was caused by OPA
//
// Independent Watchdog Timer (IWDG) functions available:
// ------------------------------------------------------
// IWDG_start(n)            start independent watchdog timer, n milliseconds, n<=5591
// IWDG_reload(n)           reload watchdog counter with n milliseconds, n<=5591
// IWDG_feed()              feed the dog (reload last time)
//
// Automatic Wake-up Timer (AWU) functions available:
// --------------------------------------------------
// AWU_start(n)             start AWU with n milliseconds period and event trigger
// AWU_stop()               stop AWU and event trigger
// AWU_set(n)               set AWU period to n milliseconds
//
// AWU_enable()             enable AWU
// AWU_disable()            disable AWU
// AWU_RT_enable()          enable AWU rising edge trigger
// AWU_RT_disable()         disable AWU rising edge trigger
// AWU_EV_enable()          enable AWU event
// AWU_EV_disable()         disable AWU event
// AWU_INT_enable()         enable AWU interrupt (without NVIC)
// AWU_INT_disable()        disable AWU interrupt (without NVIC)
//
// Sleep functions available:
// --------------------------
// SLEEP_WFI_now()          put device into SLEEP, wake up by interrupt
// SLEEP_WFE_now()          put device into SLEEP, wake up by event
// STOP_WFI_now()           put device into STOP, wake up by interrupt
// STOP_WFE_now()           put device into STOP, wake up by event
// STDBY_WFI_now()          put device into STANDBY (deep sleep), wake by interrupt
// STDBY_WFE_now()          put device into STANDBY (deep sleep), wake by event
//
// SLEEP_ms(n)              put device into SLEEP for n milliseconds (uses AWU)
// STOP_ms(n)               put device into STOP for n milliseconds (uses AWU)
// STDBY_ms(n)              put device into STANDBY for n milliseconds (uses AWU)
//
// Programmable Voltage Detector (PVD) functions available:
// --------------------------------------------------------
// PVD_enable()             enable PVD (power module clock)
// PVD_set_2V1()            set detection level to 2.1V
// PVD_set_2V3()            set detection level to 2.3V
// PVD_set_3V0()            set detection level to 3.0V
// PVD_set_4V0()            set detection level to 4.0V
// PVD_isLow()              check if VDD is below detection level
//
// Interrupt (INT) functions available:
// ------------------------------------
// INT_enable()             global interrupt enable
// INT_disable()            global interrupt disable
// INT_ATOMIC_BLOCK { }     execute block without being interrupted
//
// References:
// -----------
// - WCH Nanjing Qinheng Microelectronics: http://wch.cn
//
// 2023 by Stefan Wagner:   https://github.com/wagiminator

#pragma once

#ifdef __cplusplus
extern "C" {
#endif

#include "ch32x035.h"

// ===================================================================================
// System Options (set "1" to activate)
// ===================================================================================
#define SYS_CLK_INIT      1         // 1: init system clock on startup
#define SYS_TICK_INIT     1         // 1: init and start SYSTICK on startup
#define SYS_GPIO_EN       1         // 1: enable GPIO ports on startup
#define SYS_CLEAR_BSS     1         // 1: clear uninitialized variables
#define SYS_USE_VECTORS   0         // 1: create interrupt vector table

// ===================================================================================
// Sytem Clock Defines
// ===================================================================================
// Set system clock frequency
#ifndef F_CPU
  #define F_CPU           8000000   // 8 Mhz if not otherwise defined
#endif

// Calculate system clock settings
#if   F_CPU ==  48000000
  #define SYS_CLK_DIV     RCC_HPRE_DIV1
#elif F_CPU ==  24000000
  #define SYS_CLK_DIV     RCC_HPRE_DIV2
#elif F_CPU ==  16000000
  #define SYS_CLK_DIV     RCC_HPRE_DIV3
#elif F_CPU ==  12000000
  #define SYS_CLK_DIV     RCC_HPRE_DIV4
#elif F_CPU ==   9600000
  #define SYS_CLK_DIV     RCC_HPRE_DIV5
#elif F_CPU ==   8000000
  #define SYS_CLK_DIV     RCC_HPRE_DIV6
#elif F_CPU ==   6000000
  #define SYS_CLK_DIV     RCC_HPRE_DIV8
#elif F_CPU ==   3000000
  #define SYS_CLK_DIV     RCC_HPRE_DIV16
#elif F_CPU ==   1500000
  #define SYS_CLK_DIV     RCC_HPRE_DIV32
#elif F_CPU ==    750000
  #define SYS_CLK_DIV     RCC_HPRE_DIV64
#elif F_CPU ==    375000
  #define SYS_CLK_DIV     RCC_HPRE_DIV128
#elif F_CPU ==    187500
  #define SYS_CLK_DIV     RCC_HPRE_DIV256
#else
  #warning Unsupported system clock frequency, using internal 8 MHz
  #define SYS_CLK_DIV     RCC_HPRE_DIV6
  #undef  F_CPU
  #define F_CPU           8000000
#endif

// ===================================================================================
// System Clock Functions
// ===================================================================================
void CLK_reset(void);     // reset system clock to default state
void MCO_init(void);      // init clock output to pin PB9

// Internal 48MHz high-speed clock (HSI) functions
#define CLK_init()        RCC->CFGR0 = SYS_CLK_DIV      // init system clock
#define HSI_enable()      RCC->CTLR |=  RCC_HSION       // enable HSI
#define HSI_disable()     RCC->CTLR &= ~RCC_HSION       // disable HSI
#define HSI_ready()       (RCC->CTLR &  RCC_HSIRDY)     // check if HSI is stable

