wagiminator/Development-Boards/CH32X035F7P6_DevBoard/software/oled_sinewave/src/system.h
// Clock output functions (pin PA8)
#define MCO_setSYS()      RCC->CFGR0 = (RCC->CFGR0 & ~RCC_CFGR0_MCO) | RCC_CFGR0_MCO_SYSCLK
#define MCO_setHSI()      RCC->CFGR0 = (RCC->CFGR0 & ~RCC_CFGR0_MCO) | RCC_CFGR0_MCO_HSI
#define MCO_stop()        RCC->CFGR0 &= ~RCC_CFGR0_MCO  // stop clock output to pin PB9

// ===================================================================================
// Delay (DLY) Functions
// ===================================================================================
void DLY_ticks(uint32_t n);                                   // delay n system ticks

#define STK_init()        STK->CTLR = STK_CTLR_STE | STK_CTLR_STCLK // init SYSTICK @ F_CPU
#define DLY_US_TIME       (F_CPU / 1000000)                   // system ticks per us
#define DLY_MS_TIME       (F_CPU / 1000)                      // system ticks per ms
#define DLY_us(n)         DLY_ticks((n) * DLY_MS_TIME / 1000) // delay n microseconds
#define DLY_ms(n)         DLY_ticks((n) * DLY_MS_TIME)        // delay n milliseconds
#define DLY_cycles        DLY_ticks                           // alias

// ===================================================================================
// Reset (RST) Functions
// ===================================================================================
#define RST_now()         PFIC->CFGR    = PFIC_RESETSYS | PFIC_KEY3
#define RST_clearFlags()  RCC->RSTSCKR |= RCC_RMVF
#define RST_wasLowPower() (RCC->RSTSCKR & RCC_LPWRRSTF)
#define RST_wasWWDG()     (RCC->RSTSCKR & RCC_WWDGRSTF)
#define RST_wasIWDG()     (RCC->RSTSCKR & RCC_IWDGRSTF)
#define RST_wasSoftware() (RCC->RSTSCKR & RCC_SFTRSTF)
#define RST_wasPower()    (RCC->RSTSCKR & RCC_PORRSTF)
#define RST_wasPin()      (RCC->RSTSCKR & RCC_PINRSTF)
#define RST_wasOPA()      (RCC->RSTSCKR & RCC_OPARSTF)

// ===================================================================================
// Bootloader (BOOT) Functions
// ===================================================================================
void BOOT_now(void);        // perform software reset and jump to bootloader

// ===================================================================================
// Independent Watchdog Timer (IWDG) Functions
// ===================================================================================
void IWDG_start_t(uint16_t ticks);                        // start IWDG with n ticks
void IWDG_reload_t(uint16_t ticks);                       // reload IWDG with n ticks

#define IWDG_start(n)     IWDG_start_t((HSI_VALUE/1000)*(n)/65536)
#define IWDG_reload(n)    IWDG_reload_t((HSI_VALUE/1000)*(n)/65536)
#define IWDG_feed()       IWDG->CTLR = 0xAAAA
#define IWDG_reset()      IWDG->CTLR = 0xAAAA             // alias

// ===================================================================================
// Automatic Wake-up Timer (AWU) Functions
// ===================================================================================
void AWU_init(void);
void AWU_stop(void);

#define AWU_start(n)          {AWU_init(); AWU_set(n);}
#define AWU_enable()          AWU->CSR = 0x02
#define AWU_disable()         AWU->CSR = 0x00
#define AWU_RT_enable()       EXTI->RTENR  |=  ((uint32_t)1 << 27)
#define AWU_RT_disable()      EXTI->RTENR  &= ~((uint32_t)1 << 27)
#define AWU_EV_enable()       EXTI->EVENR  |=  ((uint32_t)1 << 27)
#define AWU_EV_disable()      EXTI->EVENR  &= ~((uint32_t)1 << 27)
#define AWU_INT_enable()      EXTI->INTENR |=  ((uint32_t)1 << 27)
#define AWU_INT_disable()     EXTI->INTENR &= ~((uint32_t)1 << 27)

#define AWU_WRVAL(n)          ((HSI_VALUE/1000)*(n)/1024)
#define AWU_LIMIT(n)          (63*(n)*1024/(HSI_VALUE/1000))

#define AWU_set(n) \
  (n <= AWU_LIMIT(   32) ? ({AWU->PSC = 0b0110; AWU->WR = AWU_WRVAL(n) /    32;}) : \
  (n <= AWU_LIMIT(   64) ? ({AWU->PSC = 0b0111; AWU->WR = AWU_WRVAL(n) /    64;}) : \
  (n <= AWU_LIMIT(  128) ? ({AWU->PSC = 0b1000; AWU->WR = AWU_WRVAL(n) /   128;}) : \
  (n <= AWU_LIMIT(  256) ? ({AWU->PSC = 0b1001; AWU->WR = AWU_WRVAL(n) /   256;}) : \
  (n <= AWU_LIMIT(  512) ? ({AWU->PSC = 0b1010; AWU->WR = AWU_WRVAL(n) /   512;}) : \
  (n <= AWU_LIMIT( 1024) ? ({AWU->PSC = 0b1011; AWU->WR = AWU_WRVAL(n) /  1024;}) : \
  (n <= AWU_LIMIT( 2048) ? ({AWU->PSC = 0b1100; AWU->WR = AWU_WRVAL(n) /  2048;}) : \
  (n <= AWU_LIMIT( 4096) ? ({AWU->PSC = 0b1101; AWU->WR = AWU_WRVAL(n) /  4096;}) : \
  (n <= AWU_LIMIT(10240) ? ({AWU->PSC = 0b1110; AWU->WR = AWU_WRVAL(n) / 10240;}) : \
  (n <= AWU_LIMIT(61440) ? ({AWU->PSC = 0b1111; AWU->WR = AWU_WRVAL(n) / 61440;}) : \
  (0)))))))))))

#define AWU_SLEEP(n)          {AWU_set(n); SLEEP_WFE_now();}
#define AWU_STOP(n)           {AWU_set(n); STOP_WFE_now();}
#define AWU_STDBY(n)          {AWU_set(n); STDBY_WFE_now();}

// ===================================================================================
// Sleep Functions
// ===================================================================================
void SLEEP_WFI_now(void);   // put device into sleep, wake up by interrupt
void SLEEP_WFE_now(void);   // put device into sleep, wake up by event
void STOP_WFI_now(void);    // put device into stop, wake up by interrupt
void STOP_WFE_now(void);    // put device into stop, wake up by event
void STDBY_WFI_now(void);   // put device into standby (deep sleep), wake up interrupt
void STDBY_WFE_now(void);   // put device into standby (deep sleep), wake up event

#define SLEEP_ms(n)           {AWU_start(n); SLEEP_WFE_now(); AWU_stop();}
#define STOP_ms(n)            {AWU_start(n); STOP_WFE_now();  AWU_stop();}
#define STDBY_ms(n)           {AWU_start(n); STDBY_WFE_now(); AWU_stop();}

// ===================================================================================
// Programmable Voltage Detector (PVD) Functions
// ===================================================================================
#define PVD_enable()          RCC->APB1PCENR |= RCC_PWREN
#define PVD_set_2V1()         PWR->CTLR &= ~PWR_CTLR_PLS
#define PVD_set_2V3()         PWR->CTLR  = (PWR->CTLR & ~PWR_CTLR_PLS) | PWR_CTLR_PLS_2V3
#define PVD_set_3V0()         PWR->CTLR  = (PWR->CTLR & ~PWR_CTLR_PLS) | PWR_CTLR_PLS_3V0
#define PVD_set_4V0()         PWR->CTLR |=  PWR_CTLR_PLS
#define PVD_isLow()           (PWR->CSR & PWR_CSR_PVDO)

#define PVD_RT_enable()       EXTI->RTENR  |=  ((uint32_t)1 << 26)
#define PVD_RT_disable()      EXTI->RTENR  &= ~((uint32_t)1 << 26)
#define PVD_FT_enable()       EXTI->FTENR  |=  ((uint32_t)1 << 26)
#define PVD_FT_disable()      EXTI->FTENR  &= ~((uint32_t)1 << 26)
#define PVD_EV_enable()       EXTI->EVENR  |=  ((uint32_t)1 << 26)
#define PVD_EV_disable()      EXTI->EVENR  &= ~((uint32_t)1 << 26)
#define PVD_INT_enable()      EXTI->INTENR |=  ((uint32_t)1 << 26)
#define PVD_INT_disable()     EXTI->INTENR &= ~((uint32_t)1 << 26)

// ===================================================================================
// Interrupt (INT) Functions
// ===================================================================================
#define INT_enable()          __enable_irq()
#define INT_disable()         __disable_irq()
#define INT_ATOMIC_BLOCK      for(INT_ATOMIC_RESTORE, __ToDo = 1; __ToDo; __ToDo = 0)
#define INT_ATOMIC_RESTORE    uint32_t __reg_save __attribute__((__cleanup__(__iRestore))) = __iSave()

// Save interrupt status and disable interrupts
static inline uint32_t __iSave(void) {
  uint32_t result;
  __asm volatile(
    #if __GNUC__ > 10
    ".option arch, +zicsr \n"
    #endif
    "csrr %0, 0x800       \n"
    "csrw 0x800, %1       \n"
    : "=&r" (result) : "r" (0x6000)
  );
  return result;
}

// Restore interrupt status
static inline void __iRestore(const uint32_t *__s) {
  __asm volatile(
    #if __GNUC__ > 10
    ".option arch, +zicsr \n"
    #endif
    "csrw 0x800, %0" : : "r" (*__s)
  );
}

// ===================================================================================
// Device Electronic Signature (ESIG)
// ===================================================================================
#define ESIG_FLASHSIZE      (*(__I uint16_t*)(0x1FFFF7E0))
#define ESIG_UID1           (*(__I uint32_t*)(0x1FFFF7E8))
#define ESIG_UID2           (*(__I uint32_t*)(0x1FFFF7EC))
#define ESIG_UID3           (*(__I uint32_t*)(0x1FFFF7F0))

// ===================================================================================
// Imported System Functions
// ===================================================================================
// Enable Global Interrupt
__attribute__((always_inline)) static inline void __enable_irq(void) {
  __asm volatile(
    #if __GNUC__ > 10
    ".option arch, +zicsr \n"
    #endif
    "csrw 0x800, %0" : : "r" (0x6088)
  );
}

// Disable Global Interrupt
__attribute__((always_inline)) static inline void __disable_irq(void) {
  __asm volatile(
    #if __GNUC__ > 10
    ".option arch, +zicsr \n"
    #endif
    "csrw 0x800, %0" : : "r" (0x6000)
  );
}

