wagiminator/Development-Boards/CH32X035F7P6_DevBoard/software/oled_sinewave/src/system.h
// Return the Machine Status Register
__attribute__((always_inline)) static inline uint32_t __get_MSTATUS(void) {
  uint32_t result;
  __asm volatile(
    #if __GNUC__ > 10
    ".option arch, +zicsr \n"
    #endif
    "csrr %0, mstatus" : "=r"(result)
  );
  return (result);
}

// Set the Machine Status Register
__attribute__((always_inline)) static inline void __set_MSTATUS(uint32_t value) {
  __asm volatile(
    #if __GNUC__ > 10
    ".option arch, +zicsr \n"
    #endif
    "csrw mstatus, %0" : : "r"(value)
  );
}

// Return the Machine ISA Register
__attribute__((always_inline)) static inline uint32_t __get_MISA(void) {
  uint32_t result;
  __asm volatile(
    #if __GNUC__ > 10
    ".option arch, +zicsr \n"
    #endif
    "csrr %0, misa" : "=r"(result)
  );
  return (result);
}

// Set the Machine ISA Register
__attribute__((always_inline)) static inline void __set_MISA(uint32_t value) {
  __asm volatile(
    #if __GNUC__ > 10
    ".option arch, +zicsr \n"
    #endif
    "csrw misa, %0" : : "r"(value)
  );
}

// Return the Machine Trap-Vector Base-Address Register
__attribute__((always_inline)) static inline uint32_t __get_MTVEC(void) {
  uint32_t result;
  __asm volatile(
    #if __GNUC__ > 10
    ".option arch, +zicsr \n"
    #endif
    "csrr %0, mtvec": "=r"(result)
  );
  return (result);
}

// Set the Machine Trap-Vector Base-Address Register
__attribute__((always_inline)) static inline void __set_MTVEC(uint32_t value) {
  __asm volatile(
    #if __GNUC__ > 10
    ".option arch, +zicsr \n"
    #endif
    "csrw mtvec, %0" : : "r"(value)
  );
}

// Return the Machine Seratch Register
__attribute__((always_inline)) static inline uint32_t __get_MSCRATCH(void) {
  uint32_t result;
  __asm volatile(
    #if __GNUC__ > 10
    ".option arch, +zicsr \n"
    #endif
    "csrr %0, mscratch" : "=r"(result)
  );
  return (result);
}

// Set the Machine Seratch Register
__attribute__((always_inline)) static inline void __set_MSCRATCH(uint32_t value) {
  __asm volatile(
    #if __GNUC__ > 10
    ".option arch, +zicsr \n"
    #endif
    "csrw mscratch, %0" : : "r"(value)
  );
}

// Return the Machine Exception Program Register
__attribute__((always_inline)) static inline uint32_t __get_MEPC(void) {
  uint32_t result;
  __asm volatile(
    #if __GNUC__ > 10
    ".option arch, +zicsr \n"
    #endif
    "csrr %0, mepc" : "=r"(result)
  );
  return (result);
}

// Set the Machine Exception Program Register
__attribute__((always_inline)) static inline void __set_MEPC(uint32_t value) {
  __asm volatile(
    #if __GNUC__ > 10
    ".option arch, +zicsr \n"
    #endif
    "csrw mepc, %0" : : "r"(value)
  );
}

// Return the Machine Cause Register
__attribute__((always_inline)) static inline uint32_t __get_MCAUSE(void) {
  uint32_t result;
  __asm volatile(
    #if __GNUC__ > 10
    ".option arch, +zicsr \n"
    #endif
    "csrr %0, mcause": "=r"(result)
  );
  return (result);
}

// Set the Machine Cause Register
__attribute__((always_inline)) static inline void __set_MCAUSE(uint32_t value) {
  __asm volatile(
    #if __GNUC__ > 10
    ".option arch, +zicsr \n"
    #endif
    "csrw mcause, %0" : : "r"(value)
  );
}

// Return Vendor ID Register
__attribute__((always_inline)) static inline uint32_t __get_MVENDORID(void) {
  uint32_t result;
  __asm volatile(
    #if __GNUC__ > 10
    ".option arch, +zicsr \n"
    #endif
    "csrr %0, mvendorid" : "=r"(result)
  );
  return (result);
}

// Return Machine Architecture ID Register
__attribute__((always_inline)) static inline uint32_t __get_MARCHID(void) {
  uint32_t result;
  __asm volatile(
    #if __GNUC__ > 10
    ".option arch, +zicsr \n"
    #endif
    "csrr %0, marchid" : "=r"(result)
  );
  return (result);
}

// Return Machine Implementation ID Register
__attribute__((always_inline)) static inline uint32_t __get_MIMPID(void) {
  uint32_t result;
  __asm volatile(
    #if __GNUC__ > 10
    ".option arch, +zicsr \n"
    #endif
    "csrr %0, mimpid" : "=r"(result)
  );
  return (result);
}

// Return Hart ID Register
__attribute__((always_inline)) static inline uint32_t __get_MHARTID(void) {
  uint32_t result;
  __asm volatile(
    #if __GNUC__ > 10
    ".option arch, +zicsr \n"
    #endif
    "csrr %0, mhartid" : "=r"(result)
  );
  return (result);
}

// Return SP Register
__attribute__((always_inline)) static inline uint32_t __get_SP(void) {
  uint32_t result;
  __asm volatile("mv %0, sp" : "=r"(result):);
  return (result);
}

// No OPeration
__attribute__((always_inline)) static inline void __NOP(void) {
  __asm volatile("nop");
}

// Enable NVIC interrupt (interrupt numbers)
__attribute__((always_inline)) static inline void NVIC_EnableIRQ(IRQn_Type IRQn) {
  NVIC->IENR[((uint32_t)(IRQn) >> 5)] = (1 << ((uint32_t)(IRQn) & 0x1F));
}

// Disable NVIC interrupt (interrupt numbers)
__attribute__((always_inline)) static inline void NVIC_DisableIRQ(IRQn_Type IRQn) {
  NVIC->IRER[((uint32_t)(IRQn) >> 5)] = (1 << ((uint32_t)(IRQn) & 0x1F));
}

// Get Interrupt Enable State
__attribute__((always_inline)) static inline uint32_t NVIC_GetStatusIRQ(IRQn_Type IRQn) {
  return((uint32_t) ((NVIC->ISR[(uint32_t)(IRQn) >> 5] & (1 << ((uint32_t)(IRQn) & 0x1F)))?1:0));
}

// Get Interrupt Pending State
__attribute__((always_inline)) static inline uint32_t NVIC_GetPendingIRQ(IRQn_Type IRQn) {
  return((uint32_t) ((NVIC->IPR[(uint32_t)(IRQn) >> 5] & (1 << ((uint32_t)(IRQn) & 0x1F)))?1:0));
}

// Set Interrupt Pending
__attribute__((always_inline)) static inline void NVIC_SetPendingIRQ(IRQn_Type IRQn) {
  NVIC->IPSR[((uint32_t)(IRQn) >> 5)] = (1 << ((uint32_t)(IRQn) & 0x1F));
}

// Clear Interrupt Pending
__attribute__((always_inline)) static inline void NVIC_ClearPendingIRQ(IRQn_Type IRQn) {
  NVIC->IPRR[((uint32_t)(IRQn) >> 5)] = (1 << ((uint32_t)(IRQn) & 0x1F));
}

// Get Interrupt Active State
__attribute__((always_inline)) static inline uint32_t NVIC_GetActive(IRQn_Type IRQn) {
  return((uint32_t)((NVIC->IACTR[(uint32_t)(IRQn) >> 5] & (1 << ((uint32_t)(IRQn) & 0x1F)))?1:0));
}

// Set Interrupt Priority
__attribute__((always_inline)) static inline void NVIC_SetPriority(IRQn_Type IRQn, uint8_t priority) {
  NVIC->IPRIOR[(uint32_t)(IRQn)] = priority;
}

