wagiminator/Development-Boards/CH32X035F7P6_DevBoard/software/oled_sinewave/src/system.h
// Wait for Interrupt
__attribute__((always_inline))  static inline void __WFI(void) {
  NVIC->SCTLR &= ~(1<<3);   // wfi
  asm volatile ("wfi");
}

// Set Event
__attribute__((always_inline)) static inline void _SEV(void) {
  uint32_t t;
  t = NVIC->SCTLR;
  NVIC->SCTLR |= (1<<3)|(1<<5);
  NVIC->SCTLR = (NVIC->SCTLR & ~(1<<5)) | ( t & (1<<5));
}

// Wait for Events
__attribute__((always_inline)) static inline void _WFE(void) {
  NVIC->SCTLR |= (1<<3);
  __asm volatile ("wfi");
}

// Wait for Events
__attribute__((always_inline)) static inline void __WFE(void) {
  _SEV();
  _WFE();
  _WFE();
}

// Set VTF Interrupt
__attribute__((always_inline)) static inline void SetVTFIRQ(uint32_t addr, IRQn_Type IRQn, uint8_t num, FunctionalState NewState) {
  if(num > 3)  return;
  if(NewState != DISABLE) {
    NVIC->VTFIDR[num] = IRQn;
    NVIC->VTFADDR[num] = ((addr&0xFFFFFFFE)|0x1);
  }
  else {
    NVIC->VTFIDR[num] = IRQn;
    NVIC->VTFADDR[num] = ((addr&0xFFFFFFFE)&(~0x1));
  }
}

// Initiate a system reset request
__attribute__((always_inline)) static inline void NVIC_SystemReset(void) {
  NVIC->CFGR = NVIC_KEY3|(1<<7);
}

// Atomic Add with 32bit value
__attribute__((always_inline)) static inline int32_t __AMOADD_W(volatile int32_t *addr, int32_t value) {
  int32_t result;
  __asm volatile ("amoadd.w %0, %2, %1" : "=r"(result), "+A"(*addr) : "r"(value) : "memory");
  return *addr;
}

// Atomic And with 32bit value
__attribute__((always_inline)) static inline int32_t __AMOAND_W(volatile int32_t *addr, int32_t value) {
  int32_t result;
  __asm volatile ("amoand.w %0, %2, %1" : "=r"(result), "+A"(*addr) : "r"(value) : "memory");
  return *addr;
}

// Atomic signed MAX with 32bit value
__attribute__((always_inline)) static inline int32_t __AMOMAX_W(volatile int32_t *addr, int32_t value) {
  int32_t result;
  __asm volatile ("amomax.w %0, %2, %1" : "=r"(result), "+A"(*addr) : "r"(value) : "memory");
  return *addr;
}

// Atomic unsigned MAX with 32bit value
__attribute__((always_inline)) static inline uint32_t __AMOMAXU_W(volatile uint32_t *addr, uint32_t value) {
  uint32_t result;
  __asm volatile ("amomaxu.w %0, %2, %1" : "=r"(result), "+A"(*addr) : "r"(value) : "memory");
  return *addr;
}

// Atomic signed MIN with 32bit value
__attribute__((always_inline)) static inline int32_t __AMOMIN_W(volatile int32_t *addr, int32_t value) {
  int32_t result;
  __asm volatile ("amomin.w %0, %2, %1" : "=r"(result), "+A"(*addr) : "r"(value) : "memory");
  return *addr;
}

// Atomic unsigned MIN with 32bit value
__attribute__((always_inline)) static inline uint32_t __AMOMINU_W(volatile uint32_t *addr, uint32_t value) {
  uint32_t result;
  __asm volatile ("amominu.w %0, %2, %1" : "=r"(result), "+A"(*addr) : "r"(value) : "memory");
  return *addr;
}

// Atomic OR with 32bit value
__attribute__((always_inline)) static inline int32_t __AMOOR_W(volatile int32_t *addr, int32_t value) {
  int32_t result;
  __asm volatile ("amoor.w %0, %2, %1" : "=r"(result), "+A"(*addr) : "r"(value) : "memory");
  return *addr;
}

// Atomically swap new 32bit value into memory using amoswap.d
__attribute__((always_inline)) static inline uint32_t __AMOSWAP_W(volatile uint32_t *addr, uint32_t newval) {
  uint32_t result;
  __asm volatile ("amoswap.w %0, %2, %1" : "=r"(result), "+A"(*addr) : "r"(newval) : "memory");
  return result;
}

// Atomic XOR with 32bit value
__attribute__((always_inline)) static inline int32_t __AMOXOR_W(volatile int32_t *addr, int32_t value) {
  int32_t result;
  __asm volatile ("amoxor.w %0, %2, %1" : "=r"(result), "+A"(*addr) : "r"(value) : "memory");
  return *addr;
}

#ifdef __cplusplus
};
#endif
